Public Attributes | List of all members
API_MenuItemRef Struct Reference
Menu integration
Reference to a menu item mounted by the API tool add-on. More...
#include <APIdefs_Interface.h>
 Public Attributes
short  | menuResID
The resource ID which the tool command belongs to.
Int32  | itemIndex
The index of the command within the specified menu.
Detailed Description
Reference to a menu item mounted by the API tool add-on.
Remarks
For the utilization of the API_MenuItemRef structure and examples see the ACAPI_Interface function.
Member Data Documentation
◆ itemIndex
 API_MenuItemRef::itemIndex
The index of the command within the specified menu.
◆ menuResID
 API_MenuItemRef::menuResID
The resource ID which the tool command belongs to.